package gold4

import java.util.*

/*
두개씩 합치는...
정렬하고 양끝에서부터 하나씩?
양끝에서부터 하나씩
1 2 3 4 5 6 7 8 9 10 -> 0
11 2 3 4 5 6 7 8 9 -> 11
11 11 3 4 5 6 7 8 -> 22
11 11 11 4 5 6 7 -> 33
11 11 11 11 5 6 -> 44
11 11 11 11 11 -> 55
22 11 11 11 -> 77
22 22 11 -> 99
22 33 -> 99+33
55 -> 187

앞에서부터 둘씩:
1 2 3 4 5 6 7 8 9 10 -> 0
3 3 4 5 6 7 8 9 10 -> 3
3 7 5 6 7 8 9 10 -> 10
3 7 11 7 8 9 10 -> 21
3 7 11 15 9 10 -> 36
3 7 11 15 19 -> 55
10 11 15 19 -> 65
10 26 19 -> 94
10 19 26 sort
29 26 -> 123
55 -> 178

10 20 40 -> 0
30 40 -> 30
70 -> 70
10 40 20 -> 0
50 20 -> 50
70 -> 120

앞에서부터 둘씩
1 2 3 4 5 6 7 8 9 10 -> 0
3 3 4 5 6 7 8 9 10 -> 3
6 4 5 6 7 8 9 10 -> 9
4 5 6 6 7 8 9 10 sort
9 6 6 7 8 9 10 -> 18
6 6 7 8 9 9 10 sort
12 7 8 9 9 10 -> 30
7 8 9 9 10 12 sort
15 9 9 10 12 -> 45
9 9 10 12 15 sort
18 10 12 15 -> 63
10 12 15 18 sort
22 15 18 -> 85
15 18 22 sort
33 22 -> 85+33 = 118
22 33 sort
55 -> 118+55 173
100,000,000

10개의 원소
5 ->5
5->3 ->7번
3-> 10번


* */


fun main() = with(System.`in`.bufferedReader()) {
    var N = readLine().toInt()
    var pq = PriorityQueue<Int>()
    repeat(N) {
        pq.add(readLine().toInt())
    }

    var answer = 0
    while (pq.size > 1) {
        var poll1 = pq.poll()
        var poll2 = pq.poll()
        pq.add(poll1 + poll2)
        answer += poll1 + poll2
    }

    println(answer)
}